#+title: C++ 中的代码重用
#+created: [2022-03-25 Fri 16:36]
#+author: Min-Ye Zhang

* 新提到的标准库
#+begin_src cpp :eval never
#include<valarray>
using namespace std;
valarray<int> va1; // empty int array
valarray<int> va2(2); // 2 int
valarray<double> va3(0.0, 3); // 3 double, set to 0.0
valarray<int> va4 = {1, 2, 3}; // C++ 11

double gpas[5] = {3.2, 3.3, 4.0, 2.8, 2.1};
valarray<double> va5(gpas, 4); // init with first 4 of gpas
#+end_src

另外还有一个 cstring 函数 ~strchr~
#+begin_src cpp :results verbatim
#include <cstring>
#include <iostream>
int main() {
    using std::cout;
    using std::endl;
    cout << std::strchr("abcd", 'a') << endl;
    cout << std::strchr("abcd", 'c') << endl;
    cout << std::strchr("abcd", 'e') << endl;
    return 0;
}
#+end_src

#+RESULTS:
: abcd
: cd

